#### Pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [9]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
d = {'a':10,'b':20,'c':30}

In [10]:
pd.Series(data)

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series(data,index = labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [19]:
labels

['a', 'b', 'c']

In [20]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [21]:
s1 = pd.Series([1,2,3,4],['India','USA','Canada','Japan'])
s1

India     1
USA       2
Canada    3
Japan     4
dtype: int64

In [22]:
s2 = pd.Series([1,2,5,4],['India','USA','China','Japan'])
s2

India    1
USA      2
China    5
Japan    4
dtype: int64

In [23]:
s1['USA']

2

In [24]:
s3 = pd.Series(data=labels)

In [28]:
s3[0]

'a'

In [26]:
s3

0    a
1    b
2    c
dtype: object

In [29]:
s1 + s2

Canada    NaN
China     NaN
India     2.0
Japan     8.0
USA       4.0
dtype: float64

In [30]:
s2

India    1
USA      2
China    5
Japan    4
dtype: int64

#### DataFrames

In [39]:
import numpy as np
import pandas as pd

In [40]:
from numpy.random import randn

In [41]:
np.random.seed(101)

In [44]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [45]:
df

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419
E  0.147027 -0.479448  0.558769  1.024810

In [46]:
df['W']

A   -0.116773
B   -0.993263
C    1.025984
D    2.154846
E    0.147027
Name: W, dtype: float64

In [47]:
type(df['W'])

pandas.core.series.Series

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df.W

A   -0.116773
B   -0.993263
C    1.025984
D    2.154846
E    0.147027
Name: W, dtype: float64

In [50]:
df[['W','Z']]

          W         Z
A -0.116773  1.996652
B -0.993263  0.000366
C  1.025984  0.649826
D  2.154846 -0.346419
E  0.147027  1.024810

In [51]:
df['new'] = df['W'] + df['Y']

In [53]:
df

          W         X         Y         Z       new
A -0.116773  1.901755  0.238127  1.996652  0.121354
B -0.993263  0.196800 -1.136645  0.000366 -2.129908
C  1.025984 -0.156598 -0.031579  0.649826  0.994405
D  2.154846 -0.610259 -0.755325 -0.346419  1.399521
E  0.147027 -0.479448  0.558769  1.024810  0.705796

In [56]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419
E  0.147027 -0.479448  0.558769  1.024810

In [57]:
df

          W         X         Y         Z       new
A -0.116773  1.901755  0.238127  1.996652  0.121354
B -0.993263  0.196800 -1.136645  0.000366 -2.129908
C  1.025984 -0.156598 -0.031579  0.649826  0.994405
D  2.154846 -0.610259 -0.755325 -0.346419  1.399521
E  0.147027 -0.479448  0.558769  1.024810  0.705796

In [58]:
df.drop('new',axis=1,inplace=True)

In [59]:
df

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419
E  0.147027 -0.479448  0.558769  1.024810

In [60]:
df.drop('E')

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419

In [61]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419

In [62]:
df.shape

(5, 4)

In [63]:
df

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419
E  0.147027 -0.479448  0.558769  1.024810

In [65]:
df[['Z','X']]

          Z         X
A  1.996652  1.901755
B  0.000366  0.196800
C  0.649826 -0.156598
D -0.346419 -0.610259
E  1.024810 -0.479448

In [66]:
# Rows

In [67]:
df

          W         X         Y         Z
A -0.116773  1.901755  0.238127  1.996652
B -0.993263  0.196800 -1.136645  0.000366
C  1.025984 -0.156598 -0.031579  0.649826
D  2.154846 -0.610259 -0.755325 -0.346419
E  0.147027 -0.479448  0.558769  1.024810

In [68]:
df.loc['A']

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: A, dtype: float64

In [69]:
df.iloc[2]

W    1.025984
X   -0.156598
Y   -0.031579
Z    0.649826
Name: C, dtype: float64

In [70]:
df.loc['B','Y']

-1.1366445936091856

In [73]:
df.loc[['A','B'] , ['W','Y'] ]

          W         Y
A -0.116773  0.238127
B -0.993263 -1.136645